% Zhou Zhiguo
% 2019.4.23
% Ch5 数字滤波器设计
% 脉冲响应不变变换法---impinvar 

% 说明：编程详细思路 -- 早期版

clear; 
close all;
clc;

%--------------------------------------------------------------------------
% P194 教学demo
% 采用脉冲响应不变变换法，设计数字巴特沃斯滤波器
% 通带 Wp = 0.2*pi     1dB
% 阻带 Ws = 0.3~1*pi   15dB
% 求：N,H(z),H(ejw),直接-I
%--------------------------------------------------------------------------
T = 1;
fs = 1;
Wp = 0.2*pi; 
Ws = 0.3*pi;
Ap = 1;     %dB
As = 15;    %dB

%--------------------------------------------------------------------------
%模拟原型滤波器，采用freqs自动绘制幅频、相频图
%--------------------------------------------------------------------------
%[n,Wn] = buttord(Wp,Ws,Rp,Rs,'s') finds the minimum order n and cutoff frequencies Wn for an analog Butterworth filter. 
%Specify the frequencies Wp and Ws in radians per second. The passband or the stopband can be infinite.
[N,Wc] = buttord(Wp,Ws,Ap,As,'s'); %返回最小N和Wn，计算结果：Wn = 0.2256
%[N,Wc] = buttord(Wp,Ws,Ap,As);    %返回最小N，计算结果：Wn = 0.2329
%程序计算结果：Wc = 0.2256（归一化），Wc = 0.2256*pi= 0.708 满足阻带要求，给通带留裕量
%课本计算结果：Wc = 0.7032，归一化：Wc = 0.7032/pi = 0.2238 满足通带要求，给阻带留裕量

[z,p,k] = buttap(N);          % Butterworth filter prototype
%p = 
%    -0.2588 + 0.9659i
%    -0.2588 - 0.9659i
%    -0.7071 + 0.7071i
%    -0.7071 - 0.7071i
%    -0.9659 + 0.2588i
%    -0.9659 - 0.2588i
%k = 1

%程序计算结果：H(s)=1/[s-(-0.2588 + 0.9659i)][s-(-0.2588 - 0.9659i)][s-(-0.7071 + 0.7071i)][s-(-0.7071 - 0.7071i)][s-(-0.9659 + 0.2588i)][s-(-0.9659 - 0.2588i)]
%------------>H(s)=1/(s^2 + 0.5176s + 1)(s^2 + 1.414s + 1)(s^2 + 1.9318s + 1)
%------------>H(s)=1/(s^6 + 3.8634*s^5 + 7.4634*s^4 + 9.1407*s^3 + 7.4634*s^2 + 3.8634*s + 1)
%可以用卷积计算 a=[1 0.5176 1]; b=[1 1.414 1]; c=[1 1.9318 1]
%hh=conv(a,b);hhh=conv(hh,c);
%hhh = 1.0000    3.8634    7.4634    9.1407    7.4634    3.8634    1.0000

%课本计算结果：H(s)=0.12093/(s^2 + 0.3640s + 0.4945)(s^2 + 0.9945s + 0.4945)(s^2 + 1.3585s + 0.4945)
%课本计算结果：H(s)=0.12093/(s^6 + 2.7170*s^5 + 3.6910*s^4 + 3.1789*s^3 + 1.8252*s^2 + 0.6644*s + 0.1209)
%用卷积计算a=[1 0.3640 0.4945];b=[1 0.9945 0.4945];c=[1 1.3585 0.4945]
%hh=conv(a,b);hhh=conv(hh,c);
%hhh = 1.0000    2.7170    3.6910    3.1789    1.8252    0.6644    0.1209
%
%Wn^1 = 0.7032^1 = 0.7032
%Wn^2 = 0.7032^2 = 0.4945
%Wn^3 = 0.7032^3 = 0.3477
%Wn^4 = 0.7032^4 = 0.2445
%Wn^5 = 0.7032^5 = 0.1719
%Wn^6 = 0.7032^6 = 0.1209
%
%表5-1计算结果：
%表5-1计算结果：H(s)=Wn^6/(s^6 + 3.863*Wn*s^5 + 7.464*Wn^2*s^4 + 9.141*Wn^3*s^3 + 7.464*Wn^4*s^2 + 3.863*Wn^5*s + Wn^6)
%表5-1计算结果：H(s)=0.1209/(s^6 + 2.7165*s^5 + 3.6909*s^4 + 3.1786*s^3 + 1.8251*s^2 + 0.6642*s + 0.1209)
%结论：课本计算结果 = 表5-1 

%课本计算结果： H(s)=0.12093/(s^6 + 2.7170*s^5 + 3.6910*s^4 + 3.1789*s^3 + 1.8252*s^2 + 0.6644*s + 0.1209)
%程序计算结果： H(s)=1/(s^6 + 3.8634*s^5 + 7.4634*s^4 + 9.1407*s^3 + 7.4634*s^2 + 3.8634*s + 1)
%表5-1计算结果：H(s)=Wn^6/(s^6 + 3.863*Wn*s^5 + 7.464*Wn^2*s^4 + 9.141*Wn^3*s^3 + 7.464*Wn^4*s^2 + 3.863*Wn^5*s + Wn^6)
%表5-1计算结果：H(s)=0.1209/(s^6 + 2.7165*s^5 + 3.6909*s^4 + 3.1786*s^3 + 1.8251*s^2 + 0.6642*s + 0.1209)
%结论：程序计算结果把Wn归一化了！！！

%p = p*Wc*pi;  %满足课本极点显示  

[num,den] = zp2tf(z,p,k);     % Convert to transfer function form
%num = 0     0     0     0     0     0     1
%den = 1.0000    3.8637    7.4641    9.1416    7.4641    3.8637    1.0000

figure(1);
W = logspace(-pi,pi);
freqs(num,den,W)                % Frequency response of analog filter

%--------------------------------------------------------------------------
%模拟原型滤波器，自行在freqs输出h,w基础上绘制幅频、相频图
%--------------------------------------------------------------------------
figure(2);
w = logspace(-1, 1);       %scale:log 
h = freqs(num,den,w);
mag = abs(h)/abs(h(1));
dbmag = 20*log10(mag);
phase = angle(h);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree
subplot(2,1,1), loglog(w,mag)
grid on;
subplot(2,1,2), semilogx(w,degphase)
grid on;

%--------------------------------------------------------------------------
%模拟原型滤波器，幅频 线性---对数 比较图
%--------------------------------------------------------------------------
figure(3);
subplot(2,1,1), loglog(w,mag)
grid on;
subplot(2,1,2),  semilogx(w,dbmag)
grid on;

%--------------------------------------------------------------------------
%和P196 图5-41一样，但是模拟滤波器
%--------------------------------------------------------------------------
figure(4);
w = linspace(0, pi);        
h = freqs(num,den,w);
mag = abs(h)/abs(h(1));
dbmag = 20*log10(mag);
phase = angle(h);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree

subplot(3,1,1), plot(w/pi,mag)
grid on;
subplot(3,1,2), plot(w/pi,dbmag)
grid on;
subplot(3,1,3), plot(w/pi,degphase)
grid on;

%To convert to hertz, decibels, and degrees, use:
% f = w/(2*pi);
% mag = 20*log10(mag);
% phase = phase*180/pi;

%--------------------------------------------------------------------------
%数字滤波器，采用freqz自动绘制幅频、相频图
%--------------------------------------------------------------------------
figure(5);
[B,A] = butter(N,Wc,'s');
[D,C] = impinvar(B,A,fs);
freqz(D,C,1024,fs);

%--------------------------------------------------------------------------
%和P196 图5-41一样，数字滤波器
%--------------------------------------------------------------------------
figure(6);
W = linspace(0,1);        
H = freqz(D,C,W);
mag = abs(H)/abs(H(1));
dbmag = 20*log10(mag);
phase = angle(H);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree

subplot(3,1,1), plot(W,abs(H))
grid on;
subplot(3,1,2), plot(W,dbmag)
grid on;
subplot(3,1,3), plot(W,degphase)
%subplot(2,1,2), loglog(w,phase)
grid on;
