% Zhou Zhiguo
% 2019.5.4
% Ch5 数字滤波器设计
% 脉冲响应不变变换法---impinvar
% 题目：PPT 习题集P91 修改版
% 说明：采用修订版 buttord_z 函数

clear; 
close all; 
clc;

%--------------------------------------------------------------------------
% 要求：
%--------------------------------------------------------------------------
% 采用脉冲响应不变变换法，设计数字巴特沃斯滤波器
% 通带 0 < f < 2.5Hz   3dB
% 阻带  f > 50Hz   40dB
% 采样率  fs = 200Hz
% 求：N,H(z),H(ejw),直接-I

%--------------------------------------------------------------------------
% 条件：
%--------------------------------------------------------------------------
fs = 200;   %Hz
T = 1/200;
fp = 2.5;   %Hz 模拟频率
fst = 50;   %Hz 模拟频率
wp = 2*pi*fp;     %15.7080   模拟角频率
ws = 2*pi*fst;    %314.1593  模拟角频率
Wp = 2*pi*fp/fs;     %0.0785 数字频率
Ws = 2*pi*fst/fs;    %1.5708 数字频率
Ap = 3;     %dB
As = 40;    %dB

%--------------------------------------------------------------------------
% 求N，wc：
%--------------------------------------------------------------------------
%[N,Wc] = buttord_z(Wp,Ws,Ap,As,'s'); 
%wc = Wc*fs;

[N,wc] = buttord_z(wp,ws,Ap,As,'s'); 
% N = 2
% wc = 15.7266（模拟角频率）

%--------------------------------------------------------------------------
%模拟原型滤波器，求H(s)：
%--------------------------------------------------------------------------
[z,p,k] = buttap(N);          % Butterworth filter prototype
p = p*wc;  
k = k*(wc^N);
[num,den] = zp2tf(z,p,k);     % Convert to transfer function form
hs = tf(num,den);
% hs =
%           247.3
%   ---------------------
%   s^2 + 22.24 s + 247.3

%部分分式展开
Bs = num;%分子
As = den;%分母
[r,p,k] = residue(Bs,As);
% disp(r);
% disp(p);
% disp(k);
% 
% r =
%    0.0000 -11.1204i
%    0.0000 +11.1204i
% 
% p =
%  -11.1204 +11.1204i
%  -11.1204 -11.1204i

% hs =
%       0.0000 -11.1204i              0.0000 +11.1204i
%   ------------------------  +  ------------------------- 
%   s - (-11.1204 +11.1204i)      s - (-11.1204 -11.1204i)
%--------------------------------------------------------------------------


%--------------------------------------------------------------------------
%采用脉冲响应不变变换法设计
%--------------------------------------------------------------------------
[Bs,As] = butter(N,wc,'s');  %注意！！！是wc，不是Wc
%设计模拟滤波器。
%B =    0        0         247.3267
%A =    1.0000   22.2408   247.3267
%H(s) = 247.3267 / (s^2 + 22.2408*s + 247.3267)

[Dz,Cz] = impinvar(Bs,As,fs);  %注意！！！impinvar函数采用的是修正公式，“T”
%D = 0         0.0058     0
%C = 1.0000   -1.8889     0.8948

Hz = filt(Dz,Cz);
%Hz = 
%          0.005846 z^-1
%   ----------------------------
%   1 - 1.889 z^-1 + 0.8948 z^-2


%--------------------------------------------------------------------------
% 画幅频、相频图：
%--------------------------------------------------------------------------
figure;
W = linspace(0,pi);       
H = freqz(Dz,Cz,W);
mag = abs(H)/abs(H(1));
dbmag = 20*log10(mag);
phase = angle(H);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree

subplot(4,1,1), plot(W,abs(H))
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude');
title('数字滤波器 频率-幅度');

subplot(4,1,2), plot(W,dbmag)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');
%--------------------------------------------------------------------------
subplot(4,1,3), plot(W,dbmag)
grid on;
xlabel('Frequency (0~100Hz)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','10Hz','20Hz','30Hz','40Hz','50Hz','60Hz','70Hz','80Hz','90Hz','100Hz'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');
%--------------------------------------------------------------------------

subplot(4,1,4), plot(W,degphase)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Phase (degrees)');
title('数字滤波器 频率-相位');


%--------------------------------------------------------------------------
figure;
plot(W,dbmag)
grid on;
xlabel('Frequency (0~100Hz)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','10Hz','20Hz','30Hz','40Hz','50Hz','60Hz','70Hz','80Hz','90Hz','100Hz'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
% 画极零图：
%--------------------------------------------------------------------------
figure;
[z,p,k] = tf2zp(Dz,Cz);
zplane(z,p);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')

figure;
zplane(Dz,Cz);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')