%Zhou Zhiguo
%2019.4.16
%v1.0 
%从模拟函数x(t) = sin(2*pi*f1*t)+cos(2*pi*f2*t);采样，16点，得x(n)
%         x(n) = sin(2*pi*n/N)+cos(4*pi*n/N); 展示模拟到数字过程；
%xt = sin(2*pi*f1*t) + cos(2*pi*f2*t);
%f1 = 1;
%f2 = 2;
%fs = 16;  T=1/fs
%N = 16;
%n=0:1:15
%nT = n*T = n/fs
%xn = sin(2*pi*f1*nT) + cos(2*pi*f2*nT);
%   = sin(2*pi*(f1/fs)*n) + cos(2*pi*(f2/fs)*n);
%   = sin(2*pi*n/16) + cos(4*pi*n/16);
clear; 
close all;

%x(t)采用f为单位
fs = 16;%Hz
f1 = 1; %Hz
f2 = 2; %Hz
N = 16;
n = 0:1:15;
dt = 0.001;   %仿真步长：0.001s
t = 0:dt:1;  %仿真时长：2s，建议设置为2个周期即可
xt = sin(2*pi*f1*t) + cos(2*pi*f2*t); %周期T=2pi/w 1,1/2,组合波形周期为1；

figure('Name','ch2_sample1','NumberTitle','off');
%---------------------------------------------------------
%模拟信号图
%---------------------------------------------------------
subplot(3,1,1);
plot(t,xt);
xlim([0 1]);
ylim([-2 2]);
hold on;
xlabel('时间 s');
ylabel('幅值');
title('信号x(t)')
%---------------------------------------------------------
%模拟信号采样图
%---------------------------------------------------------
subplot(3,1,2);
plot(t,xt);
xlim([0 1]);
ylim([-2 2]);
hold on;
%增加取样点，便于观察；取样频率10Hz，取样间隔0.1s
x = sin(2*pi*(f1/fs)*n)+cos(4*pi*(f1/fs)*n);
stem(n/16,x);

xlabel('时间 s');
ylabel('幅值');
title('信号x(t)')
%---------------------------------------------------------
%数字序列图
%---------------------------------------------------------
subplot(3,1,3);
stem(n,x);
xlim([0 16]);
ylim([-2 2]);
xlabel('序列号');
ylabel('序列值');
title('序列x(n)')
