function Hw = linear_phase_Hw_z(h)
% Zhou Zhiguo
% 2019.5.6
% 幅频函数
%--------------------------------------------------------------------------
if firtype(h) == 1
%--------------------------------------------------------------------------
    N = length(h);
    a = zeros(1,(N-1)/2);
    a(1) = h((N-1)/2 + 1); %注意matlab 数字序列从a(1)开始，课本从a(0)开始

    for n =2:1:((N-1)/2 + 1)
       a(n) = 2*h(((N-1)/2 + 1) - n + 1); 
    end

    K = 512;
    dw = 2*pi/K;
    Hc = 0;
    Hw = zeros(1,K);

    for k =0:1:K-1
         for n = 1:1:((N-1)/2 + 1)
             Hc = Hc + a(n)*cos(k*dw*(n-1));
         end
         Hw(k+1) = Hc;
         Hc = 0;
         %Hw(k+1) = a(1) + a(2)*cos(k*dw*(2-1)) + a(3)*cos(k*dw*(3-1)) + a(4)*cos(k*dw*(4-1)) + a(5)*cos(k*dw*(5-1));
    end
%--------------------------------------------------------------------------
elseif firtype(h) == 2
%--------------------------------------------------------------------------
    N = length(h);
    b = zeros(1,N/2 + 1);
    b(1) = 0; 

    for n =2:1:(N/2 + 1)
       b(n) = 2*h((N/2 + 1) - n + 1); 
       %disp(b);
    end

    K = 512;
    dw = 2*pi/K;
    Hc = 0;
    Hw = zeros(1,K);

    for k =0:1:K-1
         for n = 1:1:N/2
             Hc = Hc + b(n+1)*cos(k*dw*(n-0.5));
             %disp(Hc);
         end
         Hw(k+1) = Hc;
         %disp(Hw);
         Hc = 0;
    end
%--------------------------------------------------------------------------   
elseif firtype(h) == 3
%--------------------------------------------------------------------------
    N = length(h);
    c = zeros(1,(N-1)/2 + 1);
    c(1) = 0; 

    for n =2:1:((N-1)/2 + 1)
       c(n) = 2*h(((N-1)/2 + 1) - n + 1); 
       %disp(c);
    end

    K = 512;
    dw = 2*pi/K;
    Hc = 0;
    Hw = zeros(1,K);

    for k =0:1:K-1
         for n = 1:1:(N-1)/2
             Hc = Hc + c(n+1)*sin(k*dw*n);  
             %disp(Hc);
         end
         Hw(k+1) = Hc;
         %disp(Hw);
         Hc = 0;
    end
%--------------------------------------------------------------------------
elseif firtype(h) == 4
%--------------------------------------------------------------------------
    N = length(h);
    d = zeros(1,N/2 + 1);
    d(1) = 0; 
        
    for n =2:1:(N/2 + 1)
       d(n) = 2*h((N/2 + 1) - n + 1); 
       %disp(d);
    end
  
    K = 512;
    dw = 2*pi/K;
    Hc = 0;
    Hw = zeros(1,K);

    for k =0:1:K-1
         for n = 1:1:N/2
             Hc = Hc + d(n+1)*sin(k*dw*(n-0.5));
             %disp(Hc);
         end
         Hw(k+1) = Hc;
         %disp(Hw);
         Hc = 0;
    end

end %if firtype

end %fun

