% Zhou Zhiguo
% 2019.5.28
% 数字信号处理 参考答案
% 题目：B5
% 说明：采用修订版 buttord_z 函数
% 双线性变换法---bilinear

clear; 
close all;
clc;

%--------------------------------------------------------------------------
% 要求：
%--------------------------------------------------------------------------
% 采用双线性变换法，设计数字巴特沃斯滤波器
% 通带 pi/8   3dB
% 阻带 pi/2   20dB
% 求：N,H(z),H(ejw),直接-I

%--------------------------------------------------------------------------
% 条件：
%--------------------------------------------------------------------------
fs = 1;   %Hz
T = 1;
Wp = 0.1*pi %pi/8;     %0.0785 数字频率
Ws = 0.4*pi %pi/2;     %1.5708 数字频率

wp = Wp/T;     % 模拟角频率
ws = Ws/T;     % 模拟角频率
fp = wp/(2*pi);   %Hz 模拟频率
fst = ws/(2*pi);   %Hz 模拟频率

Ap = 1  %3;     %dB
As = 18 %20;    %dB
%--------------------------------------------------------------------------
% 预畸：
%--------------------------------------------------------------------------
wp = 2/T*tan(Wp/2);     % 预畸 模拟角频率 0.3978
ws = 2/T*tan(Ws/2);     % 预畸 模拟角频率 2

%--------------------------------------------------------------------------
% 求N，wc：
%--------------------------------------------------------------------------
[N,wc] = buttord_z(wp,ws,Ap,As,'s'); 
% N = 2
% wc = 0.3983（模拟角频率）

%--------------------------------------------------------------------------
% 求H(s)根：方法1
%--------------------------------------------------------------------------
[z,p,k] = buttap(N);          % Butterworth filter prototype
p = p*wc;  
k = k*(wc^N);
[num,den] = zp2tf(z,p,k);     % Convert to transfer function form
% num = 0         0         0.1586
% den = 1.0000    0.5633    0.1586

hs = tf(num,den);
% hs =
%           0.1586
%   -----------------------
%   s^2 + 0.5633 s + 0.1586

%部分分式展开
Bs = num;%分子
As = den;%分母
[r,p,k] = residue(Bs,As);
% r =
%    0.0000 - 0.2816i
%    0.0000 + 0.2816i
% 
% p =
%   -0.2816 + 0.2816i
%   -0.2816 - 0.2816i
%
% hs =
%       0.0000 - 0.2816i             0.0000 + 0.2816i
%   ------------------------  +  ------------------------- 
%   s - (-0.2816 + 0.2816i)      s - (-0.2816 - 0.2816i)


%--------------------------------------------------------------------------
% 求H(s)根：方法2
%--------------------------------------------------------------------------
[Bs,As] = butter(N,wc,'s');  %注意！！！是wc，不是Wc
%设计模拟滤波器。
%B =    0         0         0.1586
%A =    1.0000    0.5633    0.1586
%H(s) = 0.1586 / (s^2 + 0.5633*s + 0.1586)

%--------------------------------------------------------------------------
% 采用双线性变换法设计：
%--------------------------------------------------------------------------
[Dz,Cz] = bilinear(Bs,As,fs);
Hz = filt(Dz,Cz);
% Hz =
%   0.03002 + 0.06003 z^-1 + 0.03002 z^-2
%   -------------------------------------
%       1 - 1.454 z^-1 + 0.5737 z^-2

%--------------------------------------------------------------------------
% 画幅频、相频图：
%--------------------------------------------------------------------------
figure;
W = linspace(0,pi);       
H = freqz(Dz,Cz,W);
mag = abs(H)/abs(H(1));
dbmag = 20*log10(mag);
phase = angle(H);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree

subplot(3,1,1), plot(W,abs(H))
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude');
title('数字滤波器 频率-幅度');

subplot(3,1,2), plot(W,dbmag)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');

subplot(3,1,3), plot(W,degphase)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Phase (degrees)');
title('数字滤波器 频率-相位');

%--------------------------------------------------------------------------
figure;
plot(W,dbmag)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');
%--------------------------------------------------------------------------


%--------------------------------------------------------------------------
% 画极零图：
%--------------------------------------------------------------------------
figure;
[z,p,k] = tf2zp(Dz,Cz);
zplane(z,p);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')

figure;
zplane(Dz,Cz);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')