% Zhou Zhiguo
% 2019.5.28
% 数字信号处理 参考答案
% 题目：5
% 说明：采用修订版 buttord_z 函数

clear; 
close all; 
clc;

%--------------------------------------------------------------------------
% 要求：
%--------------------------------------------------------------------------
% 采用脉冲响应不变变换法，设计数字巴特沃斯滤波器
% 通带 Wp = pi/8   3dB
% 阻带 Ws = pi/2   20dB
% 求：N,H(z),H(ejw),直接-I

%--------------------------------------------------------------------------
% 条件：
%--------------------------------------------------------------------------
T = 1;
fs = 1;
Wp = 0.1*pi%0.125*pi;  %0.3927
Ws = 0.45*pi%0.5*pi;    %1.5708
Ap = 2%3;     %dB
As = 18%20;    %dB

wp = Wp/T;      %模拟角频率：rad
ws = Ws/T;      %模拟角频率：rad
fp = wp/(2*pi); %模拟频率：Hz 
fst = ws/(2*pi);%模拟频率：Hz 

%--------------------------------------------------------------------------
% 求N，wc：
%--------------------------------------------------------------------------
[N,wc] = buttord_z(wp,ws,Ap,As,'s'); 
%N = 2 wc = 0.3932


%--------------------------------------------------------------------------
%模拟原型滤波器，求H(s)：
%--------------------------------------------------------------------------
[z,p,k] = buttap(N);          % Butterworth filter prototype
p = p*wc;  
k = k*(wc^N);
[num,den] = zp2tf(z,p,k);     % Convert to transfer function form
hs = tf(num,den);
% hs =
%           0.1546
%   ----------------------
%   s^2 + 0.556 s + 0.1546

%部分分式展开
Bs = num;%分子
As = den;%分母
[r,p,k] = residue(Bs,As);
% disp(r);
% disp(p);
% disp(k);
% 
% r =
%    0.0000 - 0.2780i
%    0.0000 + 0.2780i
% 
% p =
%   -0.2780 + 0.2780i
%   -0.2780 - 0.2780i

% hs =
%      0.0000 - 0.2780i           0.0000 + 0.2780i
%   ----------------------  +  ---------------------- 
%   s - (-0.2780 + 0.2780i)    s - (-0.2780 - 0.2780i)



%--------------------------------------------------------------------------
%采用脉冲响应不变变换法设计
%--------------------------------------------------------------------------
[Bs,As] = butter(N,wc,'s');
%设计模拟滤波器。
%B =      0         0         0.1546
%A = 1.0000    0.5560         0.1546
%H(s) = 0.1546 / (s^2 + 0.5560*s + 0.1546)

[Dz,Cz] = impinvar(Bs,As,fs); 
%D = 0         0.1156     0
%C = 1.0000   -1.4564    0.5735

Hz = filt(Dz,Cz);
%Hz = 
%          0.1156 z^-1
%  ---------------------------
%  1 - 1.4564 z^-1 + 0.5735 z^-2


%--------------------------------------------------------------------------
% 画幅频、相频图：
%--------------------------------------------------------------------------
figure;
W = linspace(0,pi);       
H = freqz(Dz,Cz,W);
mag = abs(H)/abs(H(1));
dbmag = 20*log10(mag);
phase = angle(H);           %输出scale:-pi~pi
degphase = phase*180/pi;    %转为degree

subplot(3,1,1), plot(W,abs(H))
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude');
title('数字滤波器 频率-幅度');

subplot(3,1,2), plot(W,dbmag)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Magnitude （dB）');
title('数字滤波器 频率-幅度 dB');

subplot(3,1,3), plot(W,degphase)
grid on;
xlabel('Frequency (0~\pi)');
xlim([0 pi]);
xticks(0:0.1*pi:pi);
xticklabels({'0','0.1\pi','0.2\pi','0.3\pi','0.4\pi','0.5\pi','0.6\pi','0.7\pi','0.8\pi','0.9\pi','\pi'})
ylabel('Phase (degrees)');
title('数字滤波器 频率-相位');

%--------------------------------------------------------------------------
% 画极零图：
%--------------------------------------------------------------------------
figure;
[z,p,k] = tf2zp(Dz,Cz);
zplane(z,p);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')

figure;
zplane(Dz,Cz);
xlim([-1 1]);
ylim([-1 1]);
grid on;
title('2th-Order Buttworth Lowpass Digital Filter')