% Zhou Zhiguo
% 2019.5.11
% Ch5 数字滤波器设计
% 线性相位 不失真

clear; 
close all;
clc;

%--------------------------------------------------------------------------
% 滤波器：延迟器
%--------------------------------------------------------------------------
num = [0,1]; %分子
den = [1,0]; %分母

Hz = filt(num,den);

%Hz = z^-1

fvtool(num,den);

%--------------------------------------------------------------------------
%输入信号x(t)，采用f为单位
%--------------------------------------------------------------------------
fs = 16;        %Hz
f1 = 1;         %Hz
f2 = 2;         %Hz
N = 16;
n = 0:1:15;
dt = 0.001;     %仿真步长：0.001s
t = 0:dt:1;     %仿真时长：2s，建议设置为2个周期即可
xt1 = sin(2*pi*f1*t);
xt2 = 2*sin(2*pi*f2*t);
%xt = sin(2*pi*f1*t) + 2*sin(2*pi*f2*t); %周期T=2pi/w 1,1/2,组合波形周期为1；
xt = xt1 + xt2;
%figure('Name','ch5_linear_phase1','NumberTitle','off');


%--------------------------------------------------------------------------
%对输入信号x(t)采样，形成序列x(n)
%--------------------------------------------------------------------------
figure;
subplot(3,1,1);
x1 = sin(2*pi*(f1/fs)*n);
x2 = 2*sin(4*pi*(f1/fs)*n);
%x = sin(2*pi*(f1/fs)*n) + 2*sin(4*pi*(f1/fs)*n);
x = x1 + x2;

stem(n,x);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列x(n)');
%增加轮廓线，便于观察；取样频率10Hz，取样间隔0.1s
hold on;
plot(t*16,xt,'red');

subplot(3,1,2);
stem(n,x1);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列x1(n)');
%增加轮廓线，便于观察；取样频率10Hz，取样间隔0.1s
hold on;
plot(t*16,xt1,'red');

subplot(3,1,3);
stem(n,x2);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列x2(n)');
%增加轮廓线，便于观察；取样频率10Hz，取样间隔0.1s
hold on;
plot(t*16,xt2,'red');

%--------------------------------------------------------------------------
%对x(n)进行滤波处理
%--------------------------------------------------------------------------
figure;
b = num;
a = den;

y1 = filter(b,a,x1);
y2 = filter(b,a,x2);
%y = filter(b,a,x);
y = y1 + y2;

subplot(3,1,1);
stem(n,y);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列y(n)');

subplot(3,1,2);
stem(n,y1);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列y1(n)');

subplot(3,1,3);
stem(n,y2);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列y2(n)');

%--------------------------------------------------------------------------
% x(n) y(n)
%--------------------------------------------------------------------------
figure;

stem(n,x);
xlim([0 16]);
ylim([-3 3]);
xlabel('序列号');
ylabel('序列值');
title('序列x(n) y(n)');
%增加轮廓线，便于观察；取样频率10Hz，取样间隔0.1s
hold on;
plot(t*16,xt,'blue');
hold on;
stem(n,y,'m');
hold on;

%增加轮廓线，便于观察；取样频率10Hz，取样间隔0.1s
n = 0:1:15;
dt = 0.001;     %仿真步长：0.001s
t = 0:dt:1;     %仿真时长：2s，建议设置为2个周期即可
plot((t*16+1),xt,'m');


